"""
    day08复习
    函数
        基础语法
            定义函数
                def 函数名称(parameter):
                    函数体  # 只干一件事

            调用函数
                函数名称(实参)

        基础概念
            参数：调用者传递给定义者的信息
                定义者要求调用者必须提供的信息
            返回值：定义者传递给调用者的结果

        参数
            实际参数
                位置实参：实参与形参按位置对应
                    序列实参：参数过多，可以将实参存储在序列中，可以用星号拆分后与形参对应
                关键字实参：实参与形参按名字对应
                    字典实参：参数过多，可以将实参存储在字典中，可以用双星号拆分后与形参对应
            形式参数
                默认形参：给形参提供一个默认值
                位置形参
                    星号元组形参（只能有一个）：让位置实参个数无限
                命名关键字形参：要求实参必须是关键字，作用是强制实参使用关键字传参
                    双星号字典形参（只能有一个）：让关键字实参个数无限

"""